Messwerte/Archiv/Raw/apache_benchmark_repeat35/default/kata/tomcat/target_count_13/repeat_1/7.txt
2020/01/17 03:13:48 Running: ab -c 100 -t 30 -n 1000000 http://192.168.3.100:8007/
2020/01/17 03:14:18 This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/
Benchmarking 192.168.3.100 (be patient)
Finished 46111 requests
Server Software:        
Server Hostname:        192.168.3.100
Server Port:            8007
Document Path:          /
Document Length:        713 bytes
Concurrency Level:      100
Time taken for tests:   30.002 seconds
Complete requests:      46111
Failed requests:        0
Non-2xx responses:      46112
Total transferred:      40025216 bytes
HTML transferred:       32877856 bytes
Requests per second:    1536.94 [#/sec] (mean)
Time per request:       65.064 [ms] (mean)
Time per request:       0.651 [ms] (mean, across all concurrent requests)
Transfer rate:          1302.82 [Kbytes/sec] received
Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0   14  57.5      3    1070
Processing:     1   50  53.7     34     812
Waiting:        1   47  48.7     33     785
Total:          1   63  77.0     48    1224
Percentage of the requests served within a certain time (ms)
  50%     48
  66%     63
  75%     74
  80%     82
  90%    110
  95%    158
  98%    235
  99%    318
 100%   1224 (longest request)
2020/01/17 03:14:18 Matched stat line [Connect:        0   14  57.5      3    1070 Connect 0 14 57.5 3 1070]
2020/01/17 03:14:18 Matched stat line [Processing:     1   50  53.7     34     812 Processing 1 50 53.7 34 812]
2020/01/17 03:14:18 Matched stat line [Waiting:        1   47  48.7     33     785 Waiting 1 47 48.7 33 785]
2020/01/17 03:14:18 Matched stat line [Total:          1   63  77.0     48    1224 Total 1 63 77.0 48 1224]
2020/01/17 03:14:18 Matched percentline [  50%     48 50 48]
2020/01/17 03:14:18 Matched percentline [  66%     63 66 63]
2020/01/17 03:14:18 Matched percentline [  75%     74 75 74]
2020/01/17 03:14:18 Matched percentline [  80%     82 80 82]
2020/01/17 03:14:18 Matched percentline [  90%    110 90 110]
2020/01/17 03:14:18 Matched percentline [  95%    158 95 158]
2020/01/17 03:14:18 Matched percentline [  98%    235 98 235]
2020/01/17 03:14:18 Matched percentline [  99%    318 99 318]
2020/01/17 03:14:18 Matched percentline [ 100%   1224 100 1224]
{"connect":{"max":1070,"mean":14,"median":3,"min":0,"stdDev":57.5},"percentiles":{"100":1224,"50":48,"66":63,"75":74,"80":82,"90":110,"95":158,"98":235,"99":318},"processing":{"max":812,"mean":50,"median":34,"min":1,"stdDev":53.70000076293945},"total":{"max":1224,"mean":63,"median":48,"min":1,"stdDev":77},"waiting":{"max":785,"mean":47,"median":33,"min":1,"stdDev":48.70000076293945}}